Repository: eddyem/apogee_control
Catalog: locale/*/*.po
Languages: ru

source: Options:
ru: Опции:

source: Found running process (pid=%d), exit.
ru: Обнаружен работающий процесс (pid=%d), выход.

source: The shutter is
ru: Затвор

source: %d seconds till pause ends
ru: %d секунд до окончания паузы

source: Additional headers:
ru: Дополнительные заголовки:

source: Any parameters are absent
ru: Не введено никаких параметров

source: Array field: (0, %d)(0, %d)
ru: Поле изображения: (0, %d)(0, %d)

source: Camera '%s' with sensor '%s' detected
ru: Обнаружена камера '%s' с датчиком '%s'

source: Can't copy data
ru: Не могу скопировать данные

source: Can't delete PIDfile
ru: Не могу удалить PID-файл

source: Can't move turret
ru: Не могу переместить турель

source: Can't munmap
ru: Не могу вызывать munmap

source: Can't open OpenGL window, image preview will be inaccessible
ru: Не могу открыть окно OpenGL, просмотр будет недоступен!

source: Can't open camera device, exit
ru: Не могу открыть камеру, завершаю

source: Can't open device file %s: %s
ru: Не могу открыть файл устройства %s: %s

source: Can't open statistics log file
ru: Не могу открыть журнал статистики

source: Can't open temperature log file
ru: Не могу открыть журнал температур

source: Can't open turret
ru: Не могу открыть турель

source: Can't save file
ru: Не могу сохранить файл

source: Capture frame %d, exp time - %g sec
ru: Захват кадра %d, время экспозиции - %g секунд

source: Changing of cooler setpoint
ru: Изменение температуры холодильника

source: Cooler is off
ru: Холодильник отключен

source: Cooler setpoint: %g
ru: Целевая температура: %g

source: Dark frames
ru: Съемка темновых

source: Device not found
ru: Устройство не найдено

source: Error in ioctl
ru: Не могу вызывать ioctl

source: Error: sleepless night!
ru: Ошибка перехода в спящий режим!

source: Expose parameters aren't specified, exit
ru: Не заданы параметры экспозиции, отключаюсь

source: Exposure time: %dms
ru: Время экспозиции: %dмс

source: Fan speed should be in interval 0..3
ru: Скорость вентилятора должна быть в пределе 0..3

source: Fan speed would be set to %d
ru: Установить скорость вращения вентиляторов в %d

source: Field of view: %s
ru: Видимое поле: %s

source: File saved as '%s'
ru: Файл записан в '%s'

source: Full statistics logging
ru: Полное журналирование статистики

source: Get signal %d, quit.
ru: Получен сигнал %d, отключаюсь.

source: Get turret's info
ru: Получить информацию о турели

source: Go to setpoint
ru: Установка заданной температуры

source: Go to sleep
ru: Спящий режим

source: Horisontal binning: %d
ru: Гор. биннинг: %d

source: IMSCALE should be greater than zero
ru: IMSCALE должно быть больше нуля

source: Image stat:
ru: Статистика по изображению

source: Image type - %s
ru: Тип изображения - %s

source: Instrument name - %s
ru: Название прибора - %s

source: Keeping setpoint
ru: Поддержание заданной температуры

source: Move turret into %d
ru: Переместить турель в позицию %d

source: No pre-expose flash
ru: Не засвечивать камеру до экспозиции

source: Object name - %s
ru: Имя объекта - %s

source: Observers: %s
ru: Наблюдатели: %s

source: Open camera number %d
ru: Работать с камерой номер %d

source: Output filename prefix: %s
ru: Префикс выходного файла: %s

source: Pause: %ds
ru: Пауза: %dс

source: Position number should be positive value
ru: Номер позиции должен быть больше 0

source: Pre-expose
ru: Предварительная экспозиция

source: Press Ctrl+C %d time[s] more to interrupt reading
ru: Нажмите Ctrl+C еще %d раз[а], чтобы прервать считывание

source: Program author: %s
ru: Автор программы: %s

source: Program name: %s
ru: Название программы: %s

source: Read image:
ru: Считывание изображения:

source: Readout error: %s
ru: Ошибка считывания: %s

source: Readout speed should be unsigned int!
ru: Скорость считывания - беззнаковое целое!

source: Required position greater then max
ru: ребуемая позиция больше максимальной

source: Reset
ru: Полный сброс

source: Save temperature log
ru: Сохранение журнала температур

source: Series of %d frames
ru: Серия из %d кадров

source: Set cooler off
ru: отключить холодильник

source: Set fan speed %d
ru: Устанавливаю скорость вращения вентиляторов в %d

source: Set logging interval to %d seconds
ru: Установить интервал логгирования в %d секунд

source: Set temperature: %.3f
ru: Установить температуру: %.3f

source: Subnet: %s
ru: Подсеть: %s

source: Switch cooler off
ru: Отключение холодильника

source: Test OpenGL window (without image exposure)
ru: Тест окна OpenGL без получения изображения

source: The temperature setpoint is too low
ru: Температура ниже допустимой

source: Try to reboot camera from web-interface
ru: Попытайтесь перезагрузить камеру через веб-интерфейс

source: Turret MAXimum position and CURrent position:
ru: Максимальная (MAX) и текущая (CUR) позиции турели:

source: Turret number should be positive value
ru: Номер турели должен быть больше 0

source: Unknown status
ru: Хрен знает что

source: Value of time-interval must be non-zero positive
ru: Значение time-interval должно быть натуральным числом

source: Vertical binning: %d
ru: Верт. биннинг: %d

source: Wait, while turret is moving
ru: Подождите завершения перемещения турели

source: Wakeup camera
ru: Активировать камеру

source: Will show images
ru: Отображение снятых кадров

source: Work with turret %d
ru: Работать с турелью %d

source: Wrong
ru: Неверный

source: Wrong camera number: %s
ru: Неверный номер камеры: %s

source: Wrong exposure time: %s
ru: Неверное время экспозиции: %s

source: Wrong frames number in series: %s
ru: Неверное кол-во кадров: %s

source: Wrong lower border: %s
ru: Неверная нижняя граница: %s

source: Wrong pause length: %s
ru: Неверная пауза: %s

source: Wrong temperature: %s (must be from -35 to 30)
ru: Неверное значение температуры: %s (должно быть от -35 до 30)

source: Wrong upper border: %s
ru: Неверная верхняя граница: %s

source: X range: [%d, %d]
ru: Диапазон по X: [%d, %d]

source: Y range: [%d, %d]
ru: Диапазон по Y: [%d, %d]

source: close shutter
ru: заткрыть затвор

source: closed
ru: закрыт

source: display last image
ru: Отобразить на экране полученное изображение

source: don't flash CCD chip before expose
ru: не засвечивать матрицу перед экспозицией

source: don't flush ccd after expose
ru: не очищать матрицу после считывания

source: don't open camera device, just show FITS header
ru: не открывать устройство, лишь отобразить шапку FITS

source: don't save images, only make all-stat log
ru: не сохранять изображения, лишь вести запись статистки

source: file with default headers
ru: имя файла с заголовками по умолчанию

source: flip image horizontally (around Y axe)
ru: отразить изображение горизонтально (относительно оси Y)

source: flip image vertically (around X axe)
ru: отразить изображение вертикально (относительно оси X)

source: full reset
ru: Полный сброс

source: get turret's parameters
ru: получить сведения о турели

source: go to sleeping mode
ru: перейти в спящий режим

source: horizontal binning to N pixels
ru: биннинг N пикселей по горизонтали

source: image scale without binning
ru: масштаб изображения без биннинга

source: image type
ru: тип изображения

source: instrument name
ru: название прибора

source: make a preliminary zero exposition for cleaning CCD
ru: выполнить предварительную нулевую экспозицию для очистки матрицы

source: make pause for ptime seconds between expositions
ru: выдержать ptime секунд между экспозициями

source: make series of N frames
ru: N кадров в серии

source: make temperatures logging to file temp_log
ru: вести запись рабочих температур в файл temp_log

source: malloc() failed!
ru: Ошибка выделения памяти!

source: not open shutter when exposing ("dark frames")
ru: не открывать затвор при экспозиции ("темновые")

source: not save image, just show statistics
ru: не сохранять изображение, а только отобразить статистику

source: object name
ru: название объекта

source: observers' names
ru: имена наблюдателей

source: observing program name
ru: название программы наблюдений

source: only set/get temperature
ru: только задать/получить температуру

source: open
ru: открыт

source: open camera by its MSG-ID
ru: открыть камеру по MSG-ID

source: open shutter
ru: открыть затвор

source: output filename prefix
ru: префикс имени выходного файла

source: program author
ru: автор программы

source: resume system
ru: возобновить питание

source: select clip region
ru: выбрать диапазон для считывания

source: set cooler off
ru: отключить холодильник

source: set exposure time to exptime ms
ru: время экспозиции exptime мс

source: set fan speed to F (0..3)
ru: Установить скорость вентиляторов в F (0..3)

source: set readout speed to N
ru: установить скорость считывания в N

source: set turret to Nth position
ru: переместить турель в N-ю позицию

source: set turret's number to N
ru: установить номер турели в N

source: set work temperature to degr C
ru: задать рабочую температуру degr градусов

source: subnet fot ethernet camera discovery
ru: Подсеть для поиска ethernet-камеры

source: time interval between sequential writings to log & HISTORY (in seconds)
ru: интервал времени между последовательными записями в лог и HISTORY (в секундах)

source: vertical binning to N pixels
ru: биннинг N пикселей по вертикали

source: work in a 12-bit ADC mode
ru: работать в 12-битном режиме

source: work with Nth camera
ru: работать с N-й камерой

source: write telescope parameters into history
ru: записывать в историю параметры телескопа
